lab11/nrf5x-base/lib/simple_ble.c
void __attribute__((weak)) conn_params_init(void) {
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;
    ble_gap_conn_params_t  conn_params;

    // Specify parameters for a connection
    memset(&conn_params, 0, sizeof(conn_params));
    conn_params.min_conn_interval = ble_config->min_conn_interval;
    conn_params.max_conn_interval = ble_config->max_conn_interval;
    conn_params.slave_latency     = SLAVE_LATENCY;
    conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&conn_params);
    APP_ERROR_CHECK(err_code);

    // setup connection parameter negotiation
    memset(&cp_init, 0, sizeof(cp_init));
    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = on_conn_params_evt;
    cp_init.error_handler = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

void __attribute__((weak)) services_init (void) {
}

void __attribute__((weak)) initialize_app_timer (void) {
    // allow user to overwrite if they want to change timer parameters
#ifdef SDK_VERSION_9
    // old version of the API specifying maximum number of timers
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);
#else
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
#endif
}


/*******************************************************************************
 *   HELPER FUNCTIONS
 ******************************************************************************/
void __attribute__((weak)) advertising_start(void) {
    uint32_t err_code = sd_ble_gap_adv_start(&m_adv_params);
    if (err_code != NRF_ERROR_INVALID_STATE) {
        // ignore Invalid State responses. Occurs when start is called twice
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) advertising_stop(void) {
    uint32_t err_code = sd_ble_gap_adv_stop();
    if (err_code != NRF_ERROR_INVALID_STATE) {
        // ignore Invalid State responses. Occurs when stop is called although
        //  advertising is not running
        APP_ERROR_CHECK(err_code);
    }
}

void __attribute__((weak)) power_manage(void) {
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*******************************************************************************
 *   SIMPLE BLE API
 ******************************************************************************/

simple_ble_app_t* simple_ble_init(const simple_ble_config_t* conf) {
    ble_config = conf;

    // Setup BLE and services
    ble_stack_init();
    gap_params_init();
    advertising_init();
    services_init();

    // APP_TIMER_INIT must be called before conn_params_init since it uses timers
    initialize_app_timer();
    conn_params_init();

    // initialize our connection state to "not in a connection"
    app.conn_handle = BLE_CONN_HANDLE_INVALID;

    // Return a reference to the application state so that the user of this
    // module has a pointer to the connection handle.
    return &app;
}

void simple_ble_add_service (simple_ble_service_t* service_handle) {
    uint32_t err_code;

    // Setup our long UUID so that nRF recognizes it. This is done by storing
    //  the full 128-bit UUID and using 16 bits of it as a handle
    uint16_t uuid16 = (service_handle->uuid128.uuid128[12] << 8) |(service_handle->uuid128.uuid128[13]);
    service_handle->uuid_handle.uuid = uuid16;
    err_code = sd_ble_uuid_vs_add(&(service_handle->uuid128), &(service_handle->uuid_handle.type));
    APP_ERROR_CHECK(err_code);

    // Add the custom service to the system
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
            &(service_handle->uuid_handle), &(service_handle->service_handle));
    APP_ERROR_CHECK(err_code);
}

void simple_ble_add_characteristic (uint8_t read,
                                    uint8_t write,
                                    uint8_t notify,
                                    uint8_t vlen,
                                    uint16_t len,
                                    uint8_t* buf,
                                    simple_ble_service_t* service_handle,
                                    simple_ble_char_t* char_handle) {
    volatile uint32_t err_code;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          char_uuid;
    ble_gatts_attr_md_t attr_md;

    // set characteristic metadata
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read   = read;
    char_md.char_props.write  = write;
    char_md.char_props.notify = notify;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = NULL;
    char_md.p_sccd_md         = NULL;

    // set characteristic uuid
    char_uuid.type = service_handle->uuid_handle.type;
    char_uuid.uuid = char_handle->uuid16;

    // set attribute metadata
    memset(&attr_md, 0, sizeof(attr_md));
    if (read) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    if (write) BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    attr_md.vloc    = BLE_GATTS_VLOC_USER;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = vlen;

    // set attribute data
    memset(&attr_char_value, 0, sizeof(attr_char_value));
    attr_char_value.p_uuid    = &char_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = len;
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = len; // max len can be up to BLE_GATTS_FIX_ATTR_LEN_MAX (510)
    attr_char_value.p_value   = buf;

    err_code = sd_ble_gatts_characteristic_add((service_handle->service_handle),
            &char_md, &attr_char_value, &(char_handle->char_handle));
    APP_ERROR_CHECK(err_code);
}

uint32_t simple_ble_update_char_len (simple_ble_char_t* char_handle, uint16_t len) {
    volatile uint32_t err_code;

    ble_gatts_value_t value_config;
    value_config.len = len;
    value_config.offset = 0;
    value_config.p_value = NULL;

    // Update length for vlen variable stored in user-space (VLOC_USER)
    err_code = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, char_handle->char_handle.value_handle, &value_config);
    // since this isn't a configuration-time call, actually return the error
    //  code to the user for handling rather than checking it ourselves and
    //  possibly crashing the app
    return err_code;
}

uint32_t simple_ble_notify_char (simple_ble_char_t* char_handle) {
    volatile uint32_t err_code;

    // can't notify if we aren't in a connection
    if (app.conn_handle == BLE_CONN_HANDLE_INVALID) {
        // not an error though
        return NRF_SUCCESS;
    }

    ble_gatts_hvx_params_t hvx_params;
    hvx_params.handle = char_handle->char_handle.value_handle;
    hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
    hvx_params.offset = 0;
    hvx_params.p_len = NULL; // notify full length. No response wanted
    hvx_params.p_data = NULL; // use existing value

    err_code = sd_ble_gatts_hvx(app.conn_handle, &hvx_params);
    if (err_code == NRF_ERROR_INVALID_STATE) {
        // error means notify is not enabled by the client. IGNORE
        return NRF_SUCCESS;
    }

    // since this isn't a configuration-time call, actually return the error
    //  code to the user for handling rather than checking it ourselves and
    //  possibly crashing the app
    return err_code;
}

bool simple_ble_is_char_event (ble_evt_t* p_ble_evt, simple_ble_char_t* char_handle) {
    ble_gatts_evt_write_t* p_evt_write = &(p_ble_evt->evt.gatts_evt.params.write);

